# GetCoordinatePlaneReferenceXY Method

---
C#Visual BasicVisual C++
Revit 2024 API
---
ReferencePoint..::..GetCoordinatePlaneReferenceXY Method
ReferencePoint Class See Also
---
A reference for the XY plane of the coordinate system.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public Reference GetCoordinatePlaneReferenceXY()
```

Visual Basic
---
```text
Public Function GetCoordinatePlaneReferenceXY As Reference
```

Visual C++
---
```text
public:
Reference^ GetCoordinatePlaneReferenceXY()
```

# See Also
ReferencePoint Class
Autodesk.Revit.DB Namespace